perf/nickel/10.txt
Running 20s test @ http://localhost:3000
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.22us   17.57us   1.54ms   65.45%
    Req/Sec   166.45k     5.79k  177.39k    91.54%
  3329182 requests in 20.10s, 469.89MB read
Requests/sec: 165625.72
Transfer/sec:     23.38MB